import type { itemType } from "../types/itemCard";

export const itemCardDatas: itemType[] = [
    {
        name: 'Pentacles',
        label:
            'ไพ่ใบนี้มีความหมายว่าการเริ่มต้นใหม่ ที่มีโอกาสที่ดีในอนาคต การได้รับโอกาสใหม่ๆ ที่เป็นโอกาสที่สามารถพัฒนาให้มั่นคง',
        image: './images/cards/card_pentacles.png',
        description:
            '- ความรัก <br/><br/> ด้านความรัก จะหมายถึงจุดเริ่มต้น โอกาสที่เข้ามาที่ดีจับต้องได้ ความสัมพันธ์อยู่ในระยะเริ่มต้นที่ไปใน ทิศทางที่ดีและถูกต้อง ถึงจะยังไม่ใช่จุดที่จะลงตัวเป็นแฟนกัน แต่เรียกได้ว่าเป็นการเริ่มต้นที่ดี มีโอกาสพัฒนาไปในทางที่ดี  <br/> <br/>  - การเงิน  <br/>  <br/> จะมีเงินเข้าจากช่องทาเงินหลาย ๆ ทางจากความขยันของเราเช่น การทำงานเสริม โบนัส <br/><br/> - การงาน  <br/><br/> มีโอกาสได้แสดงฝีมือความสามารถ และจะได้รับการยอมรับ อาจได้รับตำแหน่งใหม่ ที่จะทำให้คุณก้าวไปสู่ความสำเร็จในอนาคต <br/> <br/> *คำแนะนำ <br/> เตรียมตัวรับทรัพย์ เงินทอง ความสำเร็จให้ดี',
        point: 1
    },
    {
        name: 'The Cups',
        label: 'ความรู้สึกใหม่ ๆ ความสัมพันธ์มีโอกาสพัฒนา ไปในทางที่ดี ความคิดสร้างสรรค์ใหม่ ๆ ในด้านศิลปะต่าง ๆ ',
        image: './images/cards/card_thecups.png',
        description:
            '- ความรัก <br/> มีโอกาสเจอกับความรักใหม่ ถ้ามีคนรักอยูแล้วก็จะมีรักที่ชื่นมื่น <br/> - การงาน งานต่าง ๆ ที่เข้ามาเป้นสิ่งที่พึ่งพอใจ รู้สึกดี มีโอกาสที่จะสมหวังสูง หากมีปัญหาก็จะมีคนมาช่วยเหลือ <br/> - การเงิน มีโอกาสได้รับเงิน ได้รับโชคลาภตามที่คาดหวัง <br/>  - สุขภาพ หากมีการเจ็บป่วย ควรเข้าพบแพทย์ การที่ได้รับยา จะมีโอกาสหายจากโรค <br/> *คำแนะนำ ควรเตรียมพร้อมที่จะรับความรู้สึกใหม่ๆ สิ่งใหม่ที่เข้ามาควรเปิดรับแต่ก็ต้องใช้เหตุผลให้รอบคอบด้วย <br/> ',
        point: 1

    },
    {
        name: 'The Fool',
        label: 'เร็ว ๆ นี้ อาจจะมีการได้เริ่มต้นใหม่หรือลองอะไรใหม่ ๆ ที่ท้าทายมากขึ้น การเสี่ยงดวงครั้งนี้ถือแว่าคุ้มดับการที่จะลองเสี่ยงดูสักครั้งหนึ่ง',
        image: './images/cards/card_thefool.png',
        description: '- ความรัก <br/> คนที่ได้ไพ่ใบนี้ค่อนข้างที่จะดี มีอิสระที่จะได้ลองคิด ลองทบทวนในความสัมพันธ์ คนที่ได้ไพ่ใบนี้อาจจะเป็นคนที่รักตัวเองมากไม่ได้สนใจในความรักในช่วงนี้มากขนาดนั้น ยังรักอิสระอยู่ สำหรับคนที่กำลังตกหลุมรักหรือหลงรักอีก อีกฝ่ายอาจจะไม่ได้รู้สึกกับเรามากขนาดนั้น หรืออาจจะคิดไม่ได้จริงจังกับเรามาก <br/> - การเดินทาง <br/> ในช่วงนี้อาจจะมีเกณฑ์อาจจะได้เดินทางไกล ได้ออกไปทำอะไรใหม่ ๆ ลองเดินทางไปในที่ใหม่ ๆ ดู <br/> - การเงิน <br/>มีค่าใช้จ่ายที่เยอะมาก เพราะอาจจะทำหรือซื้อตามใจตัวเองอยู่เสมอ ถ้าพูดถึงเรื่องการลงทุน รอบนี้การลงทุนมีความเสี่ยงมาก ต้องรอบคอบให้มาก ๆ ในระดับหนึ่ง <br/> *คำแนะนำ \n อย่าใช้อารมณ์นำมากเกินไป ควรมีสติ และใช้เหตุผลในการคิดจะทำอะไร   ',
        point: 2

    },
    {
        name: 'The Lover',
        label: 'ไพ่ใบนี้คือทางเลือก เราอาจจะกำลังเลือกสิ่งใดสักอย่างอยู่ในเวลานี้ อาจจะมีโชคหรือชะตาที่เข้ามาเปลี่ยนที่จำเป็นต้องเลือก',
        image: './images/cards/card_thelover.png',
        description: '- ความรัก <br/> ช่วงนี้อาจจะมีคนที่เข้ามาทำให้ลำบากใจ และในตัวของคุรเองนั้นอาจจะยังไม่มั่นใจในตัวของเขาคนนั้นมากสักเท่าไหร่ จึงทำให้ลังเลหรือตัดสินใจยาก อาจจะมีโอกาสที่จะได้เจอคนเจ้าชู้อีกด้วย ในกรณีของคนที่มีคู่หรือกำลังมีความรักอยู่นั้น อาจจะมีการไม่เข้าใจกัน หรือปรับตัวเข้าหากันไม่ค่อยได้ในช่วงนี้ <br/> - การเรียน <br/> เหมือนกับการงานหรือการเรียนที่เรากำลังทำนั้นไม่ค่อยพอใจสำหรับเรามากเท่าไหร่ อาจจะตามเพื่อนหรือทำงานช้าไม่ทันเพื่อน ๆ บ้าง <br/D> - สุขภาพ <br/> ช่วงนี้ขึ้นอยู่กับสถานการณ์ คนที่ป่วยอยู่ก็อาจจะมีโอกาสที่หายดีได้ หากแข็งแรงอยู่แล้วอาจจะกลายเป็นคนรักสุขภาพก็ได้ <br/>  ',
        point: 3

    },
    {
        name: 'The Magic',
        label: 'ในไพ่ใบนี้ทุกอย่างในทุก ๆ ด้านที่เราตั้งใจหรือคาดหวังไว้ อาจจะเป็นได้ตามที่เราหวังไว้ได้เลย มีทั้งดานความคิด การทำงาน อาจจะสมหวังเหมือนที่ใจคิดได้',
        image: './images/cards/card_themagic.png',
        description: '- ความรัก <br/> ช่วงนี้ความรักออกมาได้ราบรื่นเหมือนทุกอย่างเป้นใจอะไรที่เคยไม่เข้าใจกัน ก็ได้ปรับความเข้าจกันมากขึ้น อาจจะดูดีไปหมดในทุก ๆ อย่างในความสัมพันธ์ในคนที่แอบชอบหรือตกหลุมรัก ถ้าเรากำลังจะสารภาพ ผลลัพธ์อาจจะออกมาดีกว่าที่เราคาดหวังอีกด้วย <br/> - การเงิน <br/> ไม่น่าเป็นห่วง จะมีคนคอยช่วยเหลือและยื่นมีเข้ามาทำให้ทุกอย่างราบรื่นได้ดีอย่างไร้ที่ติเลยก็ว่าได้ <br/> - สุขภาพ <br/> เรื่องนี้ไม่มีอะไรน่าเป็นห่วงมากสักเท่าไร สุขภาพที่เคยแย่อาจจะกลับมาดีเหมือนที่ใจหวังไว้ <br/> - คำแนะนำ <br/> หากมีปัญหา คุณต้องใช้ปฏิภาณ และไหวพริบในการแก้ไขปัญหา และไม่ทำอะไรผลีผลาม วู่วาม ควรมีสติ และควบคุมอารมณ์ตัวเองให้ดี',
        point: 2

    },
    {
        name: 'The moon',
        label: 'ใบนี้หมายถึงอารมณ์โดยตรง อาจจะเป็นความรู้สึกที่เราไม่ได้พูดกับใครออกไป อาจจะกลัว กังวล กลัวความลับถูกเปิดออกไป',
        image: './images/cards/card_themoon.png',
        description: '- ความรัก <br/> เป็นอารมณ์อ่อนไหวในความสัมพันธ์ มีอะไรบางอย่างอยู่ในหัวของเรา เช่น เราไปรับรู้เรื่องอะไรบางอย่างของอีกฝ่ายมาที่ทำให้เรารู้สึกว่าเราไม่มั่นคง ซึ่งจริง ๆ มันอาจจะไม่เป็นแบบนั้นก็ได้ ไพ่ใบนี้ไม่ได้เลวร้าย ทุกอย่างอาจจะเกิดขึ้นเพราะความกังวลหรือเครียดของตัวเราเอง <br/> - สุขภาพ <br/> ช่วงนี้อาจจะต้องระวังในส่วนของหัว เช่น การปวดหัว ไมเกรน และทางด้านสายตา <br/> - การเงิน <br/> มีความไม่มั่นคงทางด้านการเงินสูงมาก อาจจะมีการใช้จ่ายแบบที่เราไม่ทันตั้งตัวเกิดออกมาได้ <br/> - คำแนะนำ <br/> อย่าตื่นตระหนก หรือวิตกไปก่อน ค่อยๆดูสถานการณ์ไปก่อน ใช้เหตุผล ความรู้ มากกว่าอารมณ์',
        point: 2

    },
    {
        name: 'The Sun',
        label: 'ไพ่ใบนี้ อะไรเมื่อก่อนที่เรายังคิดไม่ออก อาจจะมีแสงสว่างในการนำทางให้เรานึกหรือคิดออกได้ง่ายกว่าครั้งก่อน ๆ อะไรที่ปิดหรือกังวลจะได้รับเปิดเผย จะได้รับการคลี่คลาย ',
        image: './images/cards/card_thesun.png',
        description: '- ความรัก <br/> ไพ่ใบนี้ดูเผินๆอาจจะดูเหมือนมีแต่ความหมายดีๆ แต่จริงๆแล้วในเรื่องความรักนี้ ต้องทายตามสถานการณ์ ซึ่งอาจจะดีหรือไม่ดีก็ได้ เช่นคนที่เป็นโสดก็อาจจะเริ่มมีความหวังกับความรักครั้งใหม่คนที่มีความรักอยู่แล้วก็อาจทำนายได้ว่าเป็นความรักที่สดใส เป็นความรักที่มีความหวัง เป็นความสัมพันธ์ที่ดี ที่มีความสุข<br/>- การเงิน <br/> บอกถึงความสดใสในเรื่องของการเงิน การเงินคล่องตัว และอาจได้ไปเที่ยว ได้เดินทาง หรืออาจจะทายได้ว่าคุณกำลังมีความคาดหวังในเรื่องของเงินที่จะได้รับ<br/>- การงาน <br/>การเรียนการงานการเรียนดีไม่มีปัญหา แม้จะมีอุปสรรคบ้างคุณก็สามารถผ่านมันได้แบบไม่ลำบากมาก หรืออาจทายได้ว่ามีการจบลงแล้วเริ่มต้นใหม่',
        point: 3

    },
{
    name: 'The Swords',
        label: 'หมายถึงการเริ่มต้นใหม่ การได้รับโอกาสใหม่ มีสิ่งใหม่ๆเข้ามา และตัวไพ่ ดาบ ที่หมายถึง ความคิด ความรู้ ตรรกะเหตุผล การติดต่อสื่อสาร ให้ไพ่ใบนี้หมายถึงจุดเริ่มต้นใหม่ๆทางความคิด',
            image: './images/cards/card_theswords.png',
                description: '-ความรัก <br/> ดูเป็นไพ่ที่ดี แต่อาจไม่ได้ดีในเรื่องความสัมพันธ์ที่ยั่งยืน แต่เรียกได้ว่า ดีสำหรับทุกฝ่าย คุณพร้อมและตัดสินใจด้วยความคิดที่มีเหตุผลแล้วล่ะว่าจะทำยังไงต่อไปกับความรักอาจจะเลือกตัดสินใจคบกันต่อ เพราะปัญหามันไม่ใช่สิ่งที่ทำให้ต้องเลิกกัน ใช่ก็ลุยต่อไป หรืออาจจะเลิกกันหากเห็นว่าต่างฝ่ายถ้าแยกย้ายกันแล้วดี <br/> -การงาน <br/> อาจจะมีการแข่งขันด้านการทำงาน แต่ผลจะออกมาดี <br/> -สุขภาพ <br/>เรื่องของสุขภาพไม่มีอะไรน่าเป็นห่วงมากการเงิน ช่วงนี้อาจจะมีค่าใช้จ่ายมากขึ้น แต่ก็อาจจะมีรายรับมากขึ้นกว่าเดิมหลายเท่า',
                    point: 1

}
];



